#+TITLE: org-mode
#+AUTHOR: Ryo Takaishi
#+LINK_HOME: http://repl.info/
#+LINK_UP: http://repl.info/emacs/config/
#+OPTIONS: toc:nil author:nil creator:nil
#+STARTUP: overview
* org-capture
:PROPERTIES:
:Modified: 1323683465
:Modified-1: <2011-12-12 月 18:51:05>
:END:

#+BEGIN_SRC emacs-lisp
  (define-key global-map "\C-cc" 'org-capture)
  
  (setq org-completion-use-helm nil)
  
  (setq org-refile-path
        (if (or run-mac (string= (system-name) "ubuntu"))
            "~/Documents/refile.org"
            "~/doc/refile.org"))
  
  (defun get-category-from-description (desc)
    (if (string-match "#\\([0-9]+\\) .*" desc)
         (match-string 1 desc)))
  
  (setq org-capture-templates
        `(("t" "todo" entry (file org-refile-path "")
           "* TODO %?\n%U\n%a\n  %i" :clock-in t :clock-resume t)
          ("p" "Phone call" entry (file "~/doc/refile.org")
           "* PHONE %? :PHONE:\n%U" :clock-in t :clock-resume t)
          ("n" "note" entry (file org-refile-path  "")
           "* %? :NOTE:\n  %u" :clock-in t :clock-resume t)
          ("j" "journal" entry (file+datetree "~/doc/diary.org")
           "* %?\n%U\n  %i" :clock-in t :clock-resume t)
          ("h" "Habit" entry (file "~/doc/refile.org")
           "* NEXT %?\n%a\nSCHEDULED: %t .+d/3d\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n")
          ;;("b" "Bookmark" entry (file+headline "~/trac.org" "Bugs of Trac")
          ("b" "Bookmark" entry (file+headline "~/work/trac.org" (plist-get (plist-get org-store-link-plist :query) :milestone))
           "* TODO %:description
  :PROPERTIES:
  :CATEGORY: %(get-category-from-description %:description)
  :ID: %(plist-get (plist-get org-store-link-plist :query) :ticket-id)
  :CUSTOMER: %(plist-get (plist-get org-store-link-plist :query) :customer)
  :URL: %:link
  :END:
  
  " :immediate-finish t)
  
          ("d" "daily report" entry (file+datetree "~/work/daily-report.org")
           "* %?")
  
          ("w" "weekly report" entry (file+datetree "~/work/weekly-report.org")
           "* %?")
  
          ))
  
  (defun in-turris ()
    (string= "turris" (system-name)))
        
  (setq org-capture-templates-contexts
        '(("d" (in-turris))
          ("w" (in-turris))))
#+END_SRC

#+RESULTS:
| key |               |       |                                         |                                                                                                   |           |   |               |   | context      |
|-----+---------------+-------+-----------------------------------------+---------------------------------------------------------------------------------------------------+-----------+---+---------------+---+--------------|
| t   | todo          | entry | (file ~/doc/refile.org )                | * TODO %?\n%U\n%a\n  %i                                                                           |           |   |               |   |              |
| n   | note          | entry | (file ~/doc/refile.org )                | * %? :NOTE:\n  %u                                                                                 | :clock-in | t | :clock-resume | t |              |
| j   | journal       | entry | (file+datetree ~/doc/diary.org)         | * %?\n%U\n  %i                                                                                    | :clock-in | t | :clock-resume | t |              |
| h   | Habit         | entry | (file ~/doc/refile.org)                 | * NEXT %?\n%a\nSCHEDULED: %t .+d/3d\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n |           |   |               |   |              |
|-----+---------------+-------+-----------------------------------------+---------------------------------------------------------------------------------------------------+-----------+---+---------------+---+--------------|
| d   | daily report  | entry | (file+datetree ~/doc/daily-report.org)  |                                                                                                   |           |   |               |   | アリエル社内 |
| w   | weekly report | entry | (file+datetree ~/doc/weekly-report.org) |                                                                                                   |           |   |               |   | アリエル社内 |
|-----+---------------+-------+-----------------------------------------+---------------------------------------------------------------------------------------------------+-----------+---+---------------+---+--------------|

#+BEGIN_SRC javascript
  javascript:location.href='org-protocol://capture://b/'+encodeURIComponent(location.href)+'/'+encodeURIComponent(document.title)+'/'+encodeURIComponent(document.evaluate('descendant::a[@class="milestone"]',%20document,%20null,%20XPathResult.ORDERED_NODE_SNAPSHOT_TYPE,%20null).snapshotItem(0).innerHTML)
#+END_SRC

